<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1c57bf5f6d78a11f431f484b22d535ea81e50202fbce513fc4999f58ebdab4d2","plan_job_ref":"Job Test plan target and replace #395 at https://github.com/dflook/terraform-github-actions/actions/runs/7440040487","plan_out_hash":"8b743ac6410ff0b2722ac402497d10aae2f037ebd386942fb5e70b45c4e40b5d","plan_hash":"46f01f2879e21795be4f4f6f9ff7ea1827822c55d7131d58fa5ea1fed84a2179","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "vX3rmQ0pQF" -> (known after apply)
!~  foreach = "CMMrhO8unV" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #395](https://github.com/dflook/terraform-github-actions/actions/runs/7440040487)